function 宠物奇缘成就完成判断(奇遇成就名)
	local 宠物奇遇成就触发表  ={
	["苗疆异客"] = "宠物奇缘·滇南行",
	["背负天地"] = "宠物奇缘·竹马情",
	["戊戌招财"] = "宠物奇缘·一念间",
	["戊戌寄鸿"] = "宠物奇缘·烟花戏·风",
	["芳草萋萋"] = "宠物奇缘·青草歌",
	["碧海蓝天"] = "宠物奇缘·沙海谣 ",
	["大食来客"] = "宠物奇缘·锋芒展",
	["戊戌搭顺"] = "宠物奇缘·烟花戏·月",
	["酗酒酒客"] = "宠物奇缘·捉妖记",
	["戊戌迎瑞"] = "宠物奇缘·烟花戏·秋",
	["一诺千金"] = "宠物奇缘·枫林酒",
	["叮当叮当"] = "宠物奇缘·北行镖",
	["瀚海伏波"] = "宠物奇缘·烹调法",
	["戊戌腾运"] = "宠物奇缘·锻剑女",
	["憨态可掬"] = "宠物奇缘·归安志·安",
	["吉星高照"] = "宠物奇缘·归安志·志",
	["镜花水月"] = "宠物奇缘·归安志·归",
	["古灵精怪"] = "宠物奇缘·孩童书",
	["蟹胜负"] = "宠物奇缘·胜负局",
	["荆轲刺秦"] = "宠物奇缘·荆轲刺",
	["戊戌盈丰"] = "宠物奇缘·白雪忆",
	["落英缤纷"] = "宠物奇缘·关外商",
	["戊戌华贵"] = "宠物奇缘·戎马边",
	["清茶一杯"] = "宠物奇缘·清茗经",
	["一醉千年"] = "宠物奇缘·东海客",
	["一点落墨"] = "宠物奇缘·至尊宝",
	["红绸之衣"] = "宠物奇缘·红衣歌",
	["童心不泯"] = "宠物奇缘·归乡路",
	["黄袍在身"] = "宠物奇缘·破晓鸣",
	["戊戌豪富"] = "宠物奇缘·稚子心",
	["稳如磐石"] = "宠物奇缘·石敢当",
	["星辰大海"] = "宠物奇缘·儿女事",
	["客江干"] = "宠物奇缘·客江干",
	["秘宝图"] = "宠物奇缘·秘宝图",
	["太行道"] = "宠物奇缘·太行道",
	}
	if not 宠物奇遇成就触发表[奇遇成就名] then
		OutputMessage("该成就:" .. 奇遇成就名 .. ' 不存在')
		return 0
	end
	if rCmdEx(string.format("AutoQuest.GetAchievementInfo('%s')",宠物奇遇成就触发表[奇遇成就名])) == 1 then
		-- 如果 宠物奇缘·稚子心 完成了,则需要判断 宠物奇缘·烟花戏·春 是不是完成了,未完成,返回2 完成了,直接提示完成
		if 奇遇成就名 == "戊戌豪富" and rCmdEx("AutoQuest.GetAchievementInfo('宠物奇缘·烟花戏·春')") == 0 then
		   return 2
		end
		OutputMessage('该成就:' .. 宠物奇遇成就触发表[奇遇成就名] .. '已完成!!')
		return 1
	end
	return 2
end
function 宠物奇遇副脚本执行(奇遇成就名)
	
	local 记录名 = "宠物奇遇:" .. 奇遇成就名
	local 副脚本名 = "摸宠_" .. 奇遇成就名 .. ".lua"
	if 时间_日期执行判断完成(记录名) then
		OutputMessage('今天已做过:' .. 奇遇成就名)
		return
	end
	local nFlag = 宠物奇缘成就完成判断(奇遇成就名)
	if nFlag ~=2 then
	   return
	end
	OutputMessage('执行:' .. 副脚本名)
	if 时间_日期执行判断首次执行(记录名) then
		-- 判断是不是今天的首次,该首次是从早上7:00至明天早上6:59
		时间_日期执行首次执行记录(记录名)
		执行_副脚本(副脚本名)
	else
		if 执行_继续上次脚本记录行数() == 0 then
			执行_副脚本(副脚本名)
		end
	end
	时间_日期执行完成(记录名)
end
function 宠物奇遇初始化全局表(宠物奇缘路径)
	local 角色宠物配置表 = {}
	角色宠物配置表 = 取配置项名称(宠物奇缘路径,"摸宠公共配置表")
	OutputMessage("总数:" .. #角色宠物配置表)
	for i = #角色宠物配置表,1,-1 do
		local szKeyArry = 分割文本(角色宠物配置表[i].szKey,"|")
		if #szKeyArry == 2 then
			if 宠物奇缘成就完成判断(szKeyArry[1]) == 1 then
				table.remove(角色宠物配置表,i)
			end
		end
	end
	return 角色宠物配置表
end
function 宠物奇遇初始化()
	-- 这里
	local roletable = GetClientPlayerTB();
	local 服务器角色名 = string.format("%s%s",roletable.szServerName,roletable.szName)
	local 宠物奇缘路径 = string.format("%s\\物品配置\\宠物奇缘.ini",取运行目录路径())
	local 角色宠物配置表 = 取配置项名称(宠物奇缘路径,服务器角色名)
	if #角色宠物配置表 == 0 then
		OutputMessage("你并没有角色设置表,按默认未完成成就执行")
		角色宠物配置表 = 宠物奇遇初始化全局表(宠物奇缘路径)
	else
		OutputMessage("按" .. 服务器角色名 .. ' 配置执行摸宠活动')
	end
	设置_复活类型('原地复活')
	设置_自动换新装备('是')
	设置_自动换新背包('是')
	设置_自动ROLL('是')
	设置_各职业技能方案()
	队伍_禁止组队()
	队伍_设置主动组队('否')
	当前坐骑是奇趣坐骑则更换()
	全局_条件触发('触发奇遇','是','是','<强制下线>')
	for k,v in ipairs(角色宠物配置表) do
		local szKeyArry = 分割文本(v.szKey,"|")
		if #szKeyArry == 2 and v.szVal == '1' then
			宠物奇遇副脚本执行(szKeyArry[1])
		end
	end
	全局_条件触发('触发奇遇','否','否','<强制下线>')
	自定义账号状态('今天宠物奇遇完成')
	自定义账号状态('勾选',0)
	延时(8000)
	结束游戏()
end
宠物奇遇初始化()