-- 使用说明:
-- 唯一需要修改的是 万人斩主阵营 如果是恶人请填 恶人谷 保存
--  填阵营名的则是大号一方
--  1V1 1v2 1v3 1vN 均是使用本脚本
-- 开始杀时,手动换掉装备
------------------------- 只需换阵营名 ----------------------------------

万人斩主阵营 = "恶人谷"



-------------------------- 下面不用修改 ----------------------------------

设置_复活类型('营地复活',0)
设置_自动换新装备('是')
设置_自动换新背包('是')
设置_自动ROLL('是')
设置_各职业技能方案()
队伍_禁止组队()
队伍_设置主动组队('否')
阵营_阵营模式(1)
BUFF_被动取消BUFF('是','回神|遁影|太虚')
if 取角色阵营名字() == 万人斩主阵营 then
	if AutoFunction.GetDis(27320,29371,1076992) >=80 or AutoFunction.GetRoleszMapName() ~= '黑戈壁' then
		交通_寻路神行车夫('黑戈壁',27320,29371,1076992,'卡点下线')
	end
	while true do
		寻路Ex(27320,29371,1076992,1)
		if 选中最近敌对目标(4) then
			按键(1)
			延时(200)
			按键(2)
			延时(200)
			按键(3)
		else
			延时(200)
		end
	end
else
	if AutoFunction.GetDis(27383,29291,1076928) >=80 or AutoFunction.GetRoleszMapName() ~= '黑戈壁' then
		交通_寻路神行车夫('黑戈壁',27383,29291,1076928,'卡点下线')
	end
	while true do
		寻路Ex(27383,29291,1076928,1)
		延时(200)
	end
end