function 取当前职业师门任务名()
	local 师门任务={
	[5] = { 副脚本名 = '七秀日常师门.lua',szMapName = '七秀',x = 29527,y = 33771, z = 1057024},
	[7] = { 副脚本名 = '唐门日常师门.lua',szMapName = '唐门',x = 85466,y = 76505, z = 1076032},
	[10] = {副脚本名 = '明教日常师门.lua',szMapName = '明教',x = 62342,y = 67133, z = 1158720},
	[3] = {副脚本名 = '天策日常师门.lua',szMapName = '天策·战乱',x = 56278,y = 23991, z = 1060096},
	[1] = {副脚本名 = '少林日常师门.lua',szMapName = '少林',x = 30594,y = 53360, z = 1126144},
	[2] = {副脚本名 = '万花日常师门.lua',szMapName = '万花',x = 48008,y = 47038, z = 1161216},
	[23] = {副脚本名 = '霸刀日常师门.lua',szMapName = '霸刀山庄',x = 81307,y = 65380, z = 1170688},
	[4] = {副脚本名 = '纯阳日常师门.lua',szMapName = '纯阳',x = 25059,y = 15381, z = 1159104},
	[6] = {副脚本名 = '五毒日常师门.lua',szMapName = '五毒',x = 29843,y = 60483, z = 1051392},
	[22] = {副脚本名 = '长歌日常师门.lua',szMapName = '长歌门',x = 93495,y = 45711, z = 1057856},
	[8] = {副脚本名 = '藏剑日常师门.lua',szMapName = '藏剑山庄',x = 62256,y = 77792, z = 1113088},
	[9] = {副脚本名 = '丐帮日常师门.lua',szMapName = '丐帮',x = 72818,y = 59170, z = 1093504},
	[21] = {副脚本名 = '苍云日常师门.lua',szMapName = '苍云',x = 46006,y = 31683, z = 1072640},
	[24] = {副脚本名 = '蓬莱日常师门.lua',szMapName = '蓬莱',x = 41832,y = 45249, z = 1048896},
	}
	local me  = GetClientPlayerTB()
	return 师门任务[me.dwForceID]
end
function 师门初始化设置并执行()
	local szKeyName = '日常师门'
	设置_复活类型('原地复活')
	设置_自动换新装备('是')
	设置_自动换新背包('是')
	设置_自动ROLL('是')
	设置_各职业技能方案()
	队伍_禁止组队()
	队伍_设置主动组队('否')
	local 师表 = 取当前职业师门任务名()
	if not 师表 then
		OutputMessage('该职业没有设置师门任务')
		return
	end
	if AutoFunction.GetRoleszMapName() ~= 师表.szMapName then
		交通_寻路神行车夫(师表.szMapName,师表.x,师表.y,师表.z,'卡点下线')
	end
	执行_副脚本按每天重置执行(师表.副脚本名)
	自定义账号状态(string.format("%s日常师门",时间_取时间段日期()))
	自定义账号状态('勾选',0)
	延时(8000)
	结束游戏()
end
师门初始化设置并执行()