五行石点卡区合成方案 = {
[1] = {
	[1] = 0,
	[2] = {szName =  "不合",NeedCount = 0},
},
[2] = {
	[1] = 0,
	[2] = {szName =  "不合",NeedCount = 0},
},
[3] = {
	[1] = 0,
	[2] = {szName =  "不合",NeedCount = 0},
},
[4] = {
	[1] = 44,
	[2] = {szName =  "五行石（三级）",NeedCount = 1},
	[3] = {szName =  "五行石（一级）",NeedCount = 16},
},
[5] = {
	[1] = 0,
	[2] = {szName =  "不合",NeedCount = 0},
},
[6] = {
	[1] = 4,
	[2] = {szName =  "五行石（四级）",NeedCount = 11},
	[3] = {szName =  "五行石（三级）",NeedCount = 6},
},
}
function 精炼五行石初始化()
	-- 每天第一次会从头执行,每天第N次都是需要修改行数,每天七点重置
	if 时间_日期执行判断首次执行("五行石合成") then
		时间_日期执行首次执行记录("五行石合成")
		执行_副脚本('精炼五行石.lua')
	else
		if 执行_继续上次脚本记录行数() == 0 then
		   执行_副脚本('精炼五行石.lua')
	    end
	end
end
精炼五行石初始化()
