function 梦回稻香剧情执行(剧情类型)
	local k,v
	local 不需要复活  ={
	['狼吞虎咽'] = true,
	['讳疾忌医'] = true,
	['毁于一旦'] = true,
	}
	local 需要手机解锁 ={
	['毁于一旦'] = true,
	['讳疾忌医'] = true,
	['舍身济世'] = true,
	}
	if 剧情类型 == "招安悍匪" then
	   剧情类型 = "招兵悍匪"
	end
	local 副脚本名  = "周庆_" .. 剧情类型 .. '.lua'
	if 角色配置_读文本("梦回周庆",剧情类型) == "1" then
		return
	end
	if  需要手机解锁[剧情类型] and rCmdEx("AutoQuest.GetLockStata()") == 1  then
		local szMsg
		szMsg = string.format("日志:<%s>角色 该成就需要解锁<%s>自动跳过",GetClientPlayerTB().szName,剧情类型)
		自定义账号状态(szMsg)
		OutputMessage(szMsg)
		return
	end
	if 不需要复活[剧情类型] then
		全局_条件触发('复活跳转','营地复活','否','<营地复活>')
		设置_自动复活('否','营地复活')
	end
	OutputMessage("执行:" .. 副脚本名)
	if 剧情类型 == "铁血黎明" then
		全局_条件触发('警告存在','张大眼','是','<退出打怪>')
	end
	if AutoFunction.GetRoleszMapName() ~= '梦回稻香' then
		执行_副脚本(副脚本名)
	else
		if 执行_继续上次脚本记录行数() == 0 then
			执行_副脚本(副脚本名)
		end
	end
	角色配置_写文本("梦回周庆",剧情类型,"1")
	全局_条件触发('警告存在','张大眼','否','<退出打怪>')
end
function 梦回单脚本初始化()
	设置_复活类型('营地复活')
	设置_自动换新装备('是')
	设置_自动换新背包('是')
	设置_自动ROLL('是')
	设置_各职业技能方案()
	队伍_设置主动组队('否')
	队伍_禁止组队()
	队伍_离开队伍()
	技能_切换心法('攻击')
	全局_条件触发('复活跳转','营地复活','是','<营地复活>')
	梦回稻香剧情执行("何必执着")
	梦回稻香剧情执行("重写史篇")
	梦回稻香剧情执行("隐世高人")
	梦回稻香剧情执行("铁血黎明")
	梦回稻香剧情执行("闯荡江湖")
	梦回稻香剧情执行("易道殊途")
	梦回稻香剧情执行("俪影侠踪")
	梦回稻香剧情执行("一世长宁")
	梦回稻香剧情执行("驭兽宗师")
	梦回稻香剧情执行("猪运亨通")
	梦回稻香剧情执行("招兵悍匪")
	梦回稻香剧情执行("杀手之路")
	梦回稻香剧情执行("海上仙山")
	梦回稻香剧情执行("重振药宗")
	全局_条件触发('复活跳转','营地复活','否','<营地复活>')
end
梦回单脚本初始化()