if (AutoFunction.GetRoleszMapName() == "浩气盟" or AutoFunction.GetRoleszMapName() == "恶人谷") and 技能_技能冷却("神行千里") == 1 then 自定义账号状态(交通_取物品神行冷却时间()) 延时(8000) 结束游戏() end
交通_寻路神行车夫('扬州',47098,31139,1049024,'卡点下线')

if not 控制台_定制控制设置("禁止卖装备") then NPC_批量卖物('王老虎','杂货','保留列表') end
延时(5000)
if 控制台_定制控制设置("邮寄时出售身上装备") and not 控制台_定制控制设置("禁止卖装备") then 装备_脱下装备("全部装备") 延时(2000) NPC_批量卖物('王老虎','杂货','保留列表') end
轻功寻路(46847,29270,1048896)
轻功寻路(45887,28693,1049216)
寻路Ex(45799,28577,1049280,1)
自定义账号状态("日志:主线收益:" .. 总数转金钱文本(AutoFunction.GetRoleAllMoney()))
邮寄('扬州信使','','邮寄不绑定',0,'主线满级大礼包')
邮寄('扬州信使','','邮寄不绑定',0,'主线满级大礼包')
邮寄('扬州信使','','邮寄不绑定',0,'主线满级大礼包')
邮寄('扬州信使','','邮寄不绑定',0,'主线满级大礼包')
邮寄('扬州信使','','邮寄不绑定',0,'主线满级大礼包')
邮寄('扬州信使','','邮寄不绑定',0,'主线满级大礼包')
邮寄('扬州信使','','邮寄不绑定',0,'主线满级大礼包')
寻路Ex(46188,29121,1049024,1)