--碎肉
交通_寻路神行车夫('七秀',26121,66082,1055808,'卡点下线')
清理_怪物庖丁('西湖草龟',26210,66329,1055744,20)
背包_销毁物品('灰色')
跳转至标签('<采集完毕>')

--杂碎
交通_寻路神行车夫('万花',67115,52952,1103680,'卡点下线')
清理_怪物庖丁('花猴',66861,53072,1103616,30)
背包_销毁物品('灰色')
跳转至标签('<采集完毕>')
 
--骨头
交通_寻路神行车夫('纯阳',6253,46282,1195776,'卡点下线')
清理_怪物庖丁('墨狼王',6229,46217,1195776,20)
背包_销毁物品('灰色')
跳转至标签('<采集完毕>')
 
--精肉
交通_寻路神行车夫('万花',87827,27294,1112960,'卡点下线')
清理_怪物庖丁('九色鹿',87693,27391,1112896,20)
背包_销毁物品('灰色')
跳转至标签('<采集完毕>')
 
 
<采集完毕>
自定义账号状态('勾选',0)
自定义账号状态('采集完毕')
自定义账号状态("碎肉:" .. 背包_统计物品数量('碎肉') ..'骨头:' .. 背包_统计物品数量('骨头') ..'精肉:' .. 背包_统计物品数量('精肉') .. '骨头:' .. 背包_统计物品数量('骨头') .. '血:' .. 背包_统计物品数量('血') )
自定义账号状态("日志:" .. 取主脚本运行时间())
--执行_副脚本('邮寄.lua')
延时(8000)
结束游戏()