交通_寻路神行车夫('长安·战乱',44713,66585,1063552,'卡点下线')

寻路导航(45113,62741,1063424)
寻路(45019,63275,1063488)
延时(500)
<接受任务>
NPC_对话选项连续对话控制('开')
NPC_对话('赵云睿')
延时(500)
完成所有任务('赵云睿')
延时(500)
接受所有任务('赵云睿')
NPC_对话选项连续对话控制('关')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·剑舞','<留得绝学祭先圣·剑舞>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·传奇','<留得绝学祭先圣·传奇>')
条件跳转('任务未完成跳转','赵云睿','莫为乱世人','<莫为乱世人>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·道书','<留得绝学祭先圣·道书>')
条件跳转('任务未完成跳转','赵云睿','江湖秘闻','<江湖秘闻>')
条件跳转('任务未完成跳转','赵云睿','军机要事','<军机要事>')
条件跳转('任务未完成跳转','赵云睿','舍我酒肉喂虎狼','<舍我酒肉喂虎狼>')
条件跳转('任务未完成跳转','赵云睿','普度众生','<普度众生>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·曲谱','<留得绝学祭先圣·曲谱>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·秦鼎','<留得绝学祭先圣·秦鼎>')
条件跳转('任务未完成跳转','赵云睿','玲珑阁主','<玲珑阁主>')
条件跳转('任务未完成跳转','赵云睿','天不仁兮降乱离','<天不仁兮降乱离>')
条件跳转('任务未完成跳转','赵云睿','刺杀狼牙','<刺杀狼牙>')
条件跳转('任务未完成跳转','赵云睿','衣食无忧·衣物','<衣食无忧·衣物>')
条件跳转('任务未完成跳转','赵云睿','衣食无忧·肉粥','<衣食无忧·肉粥>')
条件跳转('任务未完成跳转','赵云睿','衣食无忧·汤药','<衣食无忧·汤药>')
NPC_对话描述跳转('赵云睿','你今天已完成了10次老板娘的委托','是','<做完茶馆了>')
跳转至标签('<接受任务>')

<衣食无忧·汤药>
背包_统计列表物品数量('甘草|彼岸花','<',1,'<跨图购买物品-衣食无忧·汤药>')
<跨图购买物品-衣食无忧·汤药完毕>
寻路Ex(44933,61329,1063488,1)
NPC_判断出现在坐标附近('木木',44922,61199,1063488,5,'是','<衣食无忧·汤药Ex>')
寻路Ex(43626,61303,1063360,1)
<衣食无忧·汤药Ex>
NPC_买物('木木','活动',2,1)
NPC_买物('木木','活动',5,1)
条件跳转('任务未完成跳转','赵云睿','衣食无忧·汤药','<衣食无忧·汤药x>')
寻路Ex(44922,61231,1063488,1)
寻路Ex(45016,63418,1063488,1)
完成任务('赵云睿','衣食无忧·汤药')
跳转至标签('<接受任务>')

<衣食无忧·肉粥>
背包_统计列表物品数量('精肉|碎肉','<',1,'<跨图购买物品-衣食无忧·肉粥>')
<跨图购买物品-衣食无忧·肉粥完毕>
寻路Ex(44933,61329,1063488,1)
NPC_判断出现在坐标附近('木木',44922,61199,1063488,5,'是','<衣食无忧·肉粥Ex>')
寻路Ex(43626,61303,1063360,1)
<衣食无忧·肉粥Ex>
NPC_买物('木木','活动',1,1)
NPC_买物('木木','活动',4,1)
条件跳转('任务未完成跳转','赵云睿','衣食无忧·肉粥','<衣食无忧·肉粥x>')
寻路Ex(44922,61231,1063488,1)
寻路Ex(45016,63418,1063488,1)
完成任务('赵云睿','衣食无忧·肉粥')
跳转至标签('<接受任务>')


<衣食无忧·衣物>
背包_统计列表物品数量('杂碎|大黄','<',1,'<跨图购买物品-杂碎流民衣服>')
<跨图购买物品-杂碎准备杂碎流民衣服完毕>
寻路Ex(44933,61329,1063488,1)
NPC_判断出现在坐标附近('木木',44922,61199,1063488,5,'是','<衣食无忧·衣物Ex>')
寻路Ex(43626,61303,1063360,1)
<衣食无忧·衣物Ex>
NPC_买物('木木','活动',0,1)
NPC_买物('木木','活动',6,1)
条件跳转('任务未完成跳转','赵云睿','衣食无忧·衣物','<衣食无忧·衣物Ex>')
寻路Ex(44922,61231,1063488,1)
寻路Ex(45016,63418,1063488,1)
完成任务('赵云睿','衣食无忧·衣物')
跳转至标签('<接受任务>')
<刺杀狼牙>
上马()
NPC_任务对话完成('赵云睿','与赵云睿对话',0)
寻路Ex(45698,62709,1063104,1)
<刺杀狼牙Ex>
NPC_保持距离跟随('鬼祟的狼牙军士',15)
清理_指定怪物('鬼祟的狼牙军士',20,60)
条件跳转('任务失败跳转', '刺杀狼牙', '默认', '<刺杀狼牙失败标签>')
条件跳转('任务未完成跳转','赵云睿','刺杀狼牙','<刺杀狼牙Ex>')
寻路导航(45017,63177,1063488)
完成任务('赵云睿','刺杀狼牙')
<刺杀狼牙失败标签>
放弃任务('刺杀狼牙')
寻路导航(45017,63177,1063488)
跳转至标签('<接受任务>')
<留得绝学祭先圣·道书>
条件跳转('支线任务未完成','隋道书','留得绝学祭先圣·道书','<跨图购买物品-杂碎>')
<跨图购买物品-杂碎准备完毕>
寻路(44479,63094,1063488)
计时_初始化计时()
<留得绝学祭先圣·道书Ex>
寻路(44119,63222,1063488)
NPC_买物('黎恺','杂货',1,1)
NPC_买物('黎恺','杂货',6,1)
计时_时间秒数比较跳转(60,'是','<无茶馆材料>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·道书','<留得绝学祭先圣·道书Ex>')
寻路(44900,63024,1063424)
寻路(44957,63323,1063488)
完成任务('赵云睿','留得绝学祭先圣·道书')
跳转至标签('<接受任务>')


<留得绝学祭先圣·传奇>
条件跳转('支线任务未完成','孤本传奇话本','留得绝学祭先圣·传奇','<跨图购买物品-碎肉>')
<跨图购买物品-碎肉准备完毕>
寻路(44479,63094,1063488)
计时_初始化计时()
<留得绝学祭先圣Ex>
寻路(44119,63222,1063488)
NPC_买物('黎恺','杂货',2,1)
NPC_买物('黎恺','杂货',7,1)
计时_时间秒数比较跳转(60,'是','<无茶馆材料>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·传奇','<留得绝学祭先圣Ex>')
寻路(44900,63024,1063424)
寻路(44957,63323,1063488)
完成任务('赵云睿','留得绝学祭先圣·传奇')
跳转至标签('<接受任务>')


<莫为乱世人>
NPC_任务对话完成('赵云睿','与赵云睿对话',0)
延时(3000)
寻路(45336,63165,1063616)
延时(3000)
寻路Ex(45524,63097,1063552,1)
延时(3000)
寻路Ex(45521,63875,1063488,1)
延时(3000)
寻路Ex(45350,64734,1063104,1)
延时(3000)
<莫为乱世>
NPC_保持距离跟随('求助的流民',3)
条件跳转('任务失败跳转', '莫为乱世人', '默认', '<失败>')
NPC_存在判断跳转('遇害的流民','否','<莫为乱世>')
<流民>
清理_指定怪物('遇害的流民',10,10)
条件跳转('任务未完成跳转','赵云睿','莫为乱世人','<流民>')
寻路导航(46365,64555,1063104)
寻路导航(45017,63177,1063488)
完成任务('赵云睿','莫为乱世人')
跳转至标签('<接受任务>')
<失败>
放弃任务('莫为乱世人')
寻路导航(45017,63177,1063488)
跳转至标签('<接受任务>')


<留得绝学祭先圣·剑舞>
--OK
条件跳转('支线任务未完成','梨园剑舞之术','留得绝学祭先圣·剑舞','<跨图购买物品-精肉>')
<跨图购买物品-精肉准备完毕>
寻路(44479,63094,1063488)
计时_初始化计时()
<留得绝学祭先圣>
寻路(44119,63222,1063488)
NPC_买物('黎恺','杂货',4,1)
NPC_买物('黎恺','杂货',8,1)
计时_时间秒数比较跳转(60,'是','<无茶馆材料>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·剑舞','<留得绝学祭先圣>')
寻路(44900,63024,1063424)
寻路(44957,63323,1063488)
完成任务('赵云睿','留得绝学祭先圣·剑舞')
跳转至标签('<接受任务>')



<江湖秘闻>
寻路(44993,63559,1063488)
NPC_对话选项连续对话控制('开')
NPC_对话('赵茶')
延时(500)
条件跳转('任务未完成跳转','赵云睿','江湖秘闻','<江湖秘闻>')
NPC_对话选项Ex(0)
NPC_对话选项连续对话控制('关')
寻路(44903,63163,1063424)
完成任务('赵云睿','江湖秘闻')
跳转至标签('<接受任务>')



<军机要事>
寻路导航(49031,77901,1062848)
<军机要事1>
下马()
寻路(48651,78314,1062272)
使用物品('匿踪布')
条件跳转('任务未完成跳转','赵云睿','军机要事','<军机要事1>')
寻路导航(45017,63177,1063488)
完成任务('赵云睿','军机要事')
跳转至标签('<接受任务>')



<舍我酒肉喂虎狼>
寻路(44867,63824,1063552)
寻路(43911,63825,1063552)
寻路(43168,63778,1063552)
<汤>
地面_选中物品交互('盛汤的灶台',43104,63773,1063455)
背包_物品列表存在('汤','否','<汤>')
<饭>
地面_选中物品交互('盛饭的灶台',42947,63775,1063466)
背包_物品列表存在('饭','否','<饭>')
寻路(43182,63596,1063424)
<酒>
地面_选中物品交互('酒',43181,63570,1063424)
背包_物品列表存在('酒','否','<酒>')
<肉>
地面_选中物品交互('肘子',43212,63599,1063424)
背包_物品列表存在('肉','否','<肉>')
寻路(43396,63202,1063424)
<菜>
地面_选中物品交互('蒸鱼',43212,63599,1063424)
背包_物品列表存在('菜','否','<菜>')
寻路(43635,63164,1063424)
<虎狼>
寻路(44292,63327,1063488)
任务_NPC_对话周边NPC('舍我酒肉喂虎狼',44448,62824,1064000,'狼牙军官',20,1,1,20,nil)
任务_NPC_对话周边NPC('舍我酒肉喂虎狼',44263,62835,1063744,'狼牙军官',20,1,1,20,nil)
任务_NPC_对话周边NPC('舍我酒肉喂虎狼',44012,62848,1063744,'狼牙军士',20,1,1,20,nil)
任务_NPC_对话周边NPC('舍我酒肉喂虎狼',44331,63397,1064000,'狼牙军官',20,1,1,20,nil)
任务_NPC_对话周边NPC('舍我酒肉喂虎狼',43813,62857,1064000,'狼牙军士',20,1,1,20,nil)
条件跳转('任务未完成跳转','赵云睿','舍我酒肉喂虎狼','<虎狼>')
寻路导航(45017,63177,1063488)
完成任务('赵云睿','舍我酒肉喂虎狼')
跳转至标签('<接受任务>')





<普度众生>
计时_初始化计时()
寻路Ex(44933,61329,1063488,1)
NPC_判断出现在坐标附近('木木',44922,61199,1063488,7,'是','<祈福香>')
寻路Ex(43626,61303,1063360,1)
<祈福香>
NPC_保持距离跟随('木木',4)
NPC_买物('木木','茶馆',3,1)
计时_时间秒数比较跳转(60,'是','<无茶馆材料>')
背包_物品列表存在('祈福香','否','<祈福香>')
寻路Ex(44922,61231,1063488,1)
寻路Ex(44858,59971,1063616,1)
<众生>
寻路Ex(44009,60027,1064320,1)
NPC_任务对话完成('梵星禅师','将祈福香交给梵星禅师',0)
条件跳转('任务未完成跳转','赵云睿','普度众生','<众生>')
寻路Ex(44979,60335,1063552,1)
寻路Ex(45016,63418,1063488,1)
完成任务('赵云睿','普度众生')
跳转至标签('<接受任务>')



<留得绝学祭先圣·曲谱>
-- OK
条件跳转('支线任务未完成','梨园琵琶曲谱','留得绝学祭先圣·曲谱','<跨图购买物品-血>')
<跨图购买物品-血准备完毕>
寻路(44572,63138,1063488)
计时_初始化计时()
<留得绝学祭先圣2>
寻路(44119,63222,1063488)
NPC_买物('黎恺','杂货',3,1)
NPC_买物('黎恺','杂货',9,1)
计时_时间秒数比较跳转(60,'是','<无茶馆材料>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·曲谱','<留得绝学祭先圣2>')
寻路导航(45017,63177,1063488)
完成任务('赵云睿','留得绝学祭先圣·曲谱')
跳转至标签('<接受任务>')





<留得绝学祭先圣·秦鼎>
-- OK
条件跳转('支线任务未完成','秦铜鼎','留得绝学祭先圣·秦鼎','<跨图购买物品-铅锌矿>')
<跨图购买物品-铅锌矿准备完毕>
寻路(44572,63138,1063488)
计时_初始化计时()
<留得绝学祭先圣3>
寻路(44119,63222,1063488)
NPC_买物('黎恺','杂货',0,1)
NPC_买物('黎恺','杂货',5,1)
计时_时间秒数比较跳转(60,'是','<无茶馆材料>')
条件跳转('任务未完成跳转','赵云睿','留得绝学祭先圣·秦鼎','<留得绝学祭先圣3>')
寻路导航(45017,63177,1063488)
完成任务('赵云睿','留得绝学祭先圣·秦鼎')
跳转至标签('<接受任务>')


<玲珑阁主>
寻路(44615,63141,1063552)
<玲珑阁主1>
寻路(43999,63083,1063488)
NPC_对话('琳琳')
延时(1000)
NPC_对话选项内容('C 我要开始答题')
延时(1000)
NPC_当前页面对话描述跳转('有人在游戏中加好友','是','<好友>')
NPC_当前页面对话描述跳转('那种手机不能安装','是','<手机>')
NPC_当前页面对话描述跳转('常见的被盗方式有','是','<被盗方式>')
NPC_当前页面对话描述跳转('玲珑密保锁','是','<玲珑密保锁>')
NPC_当前页面对话描述跳转('剑网3客服电话可以在','是','<剑网3客服电话>')
NPC_当前页面对话描述跳转('忘记了登录密码怎么','是','<登录密码>')
NPC_当前页面对话描述跳转('剑3现在拥有的安全防手段','是','<剑3>')
NPC_当前页面对话描述跳转('需要修改绑定手机','是','<修改手机>')
条件跳转('任务未完成跳转','赵云睿','玲珑阁主','<玲珑阁主>')
寻路导航(45017,63177,1063488)
完成任务('赵云睿','玲珑阁主')
跳转至标签('<接受任务>')

<手机>
NPC_对话选项内容('C  塞班（Symbian）版本的手机')
跳转至标签('<玲珑阁主1>')

<好友>
NPC_对话选项内容('C  骗子，你以为这是私服呢！右键点他名字，举报他')
跳转至标签('<玲珑阁主1>')
<被盗方式>
NPC_对话选项内容('C  以上都是常见的被盗方式')
跳转至标签('<玲珑阁主1>')
<玲珑密保锁>
NPC_对话选项内容('C  登录金山西山居官方淘宝旗舰店购买（xishanju.taobao.com），等待快递送上门')
跳转至标签('<玲珑阁主1>')
<剑网3客服电话>
NPC_对话选项内容('C  以上都可')
跳转至标签('<玲珑阁主1>')
<登录密码>
NPC_对话选项内容('C  以上方式都可以')
跳转至标签('<玲珑阁主1>')
<剑3>
NPC_对话选项内容('C  以上三种，全部都有')
跳转至标签('<玲珑阁主1>')
<修改手机>
NPC_对话选项内容('C  以上方式都可以')
跳转至标签('<玲珑阁主1>')

<天不仁兮降乱离>
<找到逃难的妇人>
寻路Ex(45016,63112,1063488,1)
条件跳转('支线任务未完成','找到逃难的妇人','天不仁兮降乱离','<找到逃难的妇人>')
<天不仁兮降乱离Ex>
NPC_保持距离跟随('梁笑堂',3)
清理_指定怪物('狼牙兵痞',30,60)
条件跳转('任务失败跳转', '天不仁兮降乱离', '默认', '<天不仁兮降乱离失败标签>')
条件跳转('任务未完成跳转','赵云睿','天不仁兮降乱离','<天不仁兮降乱离Ex>')
寻路导航(45017,63177,1063488)
完成任务('赵云睿','天不仁兮降乱离')
<天不仁兮降乱离失败标签>
放弃任务('天不仁兮降乱离')
寻路导航(45017,63177,1063488)
跳转至标签('<接受任务>')

<无茶馆材料>
自定义账号状态('缺少茶馆材料')
延时(1000)
自定义账号状态('勾选',0)
延时(1000)
结束游戏(1)



<跨图购买物品-精肉>
背包_统计列表物品数量('锡矿|精肉','>',0,'<跨图购买物品-精肉准备完毕>')
账号锁定跳转('是','<无茶馆材料>')
寻路(45160,62084,1063552)
寻路(44010,62084,1063488)
寻路(43251,62084,1063424)
寻路Ex(43141,62114,1063488,1)
交易行_买物('胡雪严','锡矿',4,30,0)
延时(3000)
交易行_买物('胡雪严','精肉',4,30,0)
延时(3000)
寻路Ex(43331,62109,1063424,1)
收信_取指定物品('鲁啸声','锡矿|精肉')
背包_统计列表物品数量('锡矿|精肉','<',1,'<无茶馆材料>')
寻路(43881,62102,1063488)
寻路(45032,62102,1063488)
寻路(45054,63214,1063488)
跳转至标签('<跨图购买物品-精肉准备完毕>')

<跨图购买物品-血>
背包_统计列表物品数量('铜矿|血','>',0,'<跨图购买物品-血准备完毕>')
账号锁定跳转('是','<无茶馆材料>')
寻路(45160,62084,1063552)
寻路(44010,62084,1063488)
寻路(43251,62084,1063424)
寻路Ex(43141,62114,1063488,1)
交易行_买物('胡雪严','血',4,30,0)
延时(3000)
交易行_买物('胡雪严','铜矿',4,30,0)
延时(3000)
寻路Ex(43331,62109,1063424,1)
收信_取指定物品('鲁啸声','铜矿|血')
背包_统计列表物品数量('铜矿|血','<',1,'<无茶馆材料>')
寻路(43881,62102,1063488)
寻路(45032,62102,1063488)
寻路(45054,63214,1063488)
跳转至标签('<跨图购买物品-血准备完毕>')

<跨图购买物品-碎肉>
背包_统计列表物品数量('碎肉|千里香','>',0,'<跨图购买物品-碎肉准备完毕>')
账号锁定跳转('是','<无茶馆材料>')
寻路(45160,62084,1063552)
寻路(44010,62084,1063488)
寻路(43251,62084,1063424)
寻路Ex(43141,62114,1063488,1)
交易行_买物('胡雪严','千里香',4,30,0)
延时(3000)
交易行_买物('胡雪严','碎肉',4,30,0)
延时(3000)
寻路Ex(43331,62109,1063424,1)
收信_取指定物品('鲁啸声','碎肉|千里香')
背包_统计列表物品数量('碎肉|千里香','<',1,'<无茶馆材料>')
寻路(43881,62102,1063488)
寻路(45032,62102,1063488)
寻路(45054,63214,1063488)
跳转至标签('<跨图购买物品-碎肉准备完毕>')


<跨图购买物品-杂碎>
背包_统计列表物品数量('杂碎|大黄','>',0,'<跨图购买物品-杂碎准备完毕>')
账号锁定跳转('是','<无茶馆材料>')
寻路(45160,62084,1063552)
寻路(44010,62084,1063488)
寻路(43251,62084,1063424)
寻路Ex(43141,62114,1063488,1)
交易行_买物('胡雪严','大黄',4,30,0)
延时(3000)
交易行_买物('胡雪严','杂碎',4,30,0)
延时(3000)
寻路Ex(43331,62109,1063424,1)
收信_取指定物品('鲁啸声','杂碎|大黄')
背包_统计列表物品数量('杂碎|大黄','<',1,'<无茶馆材料>')
寻路(43881,62102,1063488)
寻路(45032,62102,1063488)
寻路(45054,63214,1063488)
跳转至标签('<跨图购买物品-杂碎准备完毕>')

<跨图购买物品-杂碎流民衣服>
背包_统计物品数量('杂碎|大黄','>',0,'<跨图购买物品-杂碎准备杂碎流民衣服完毕>')
账号锁定跳转('是','<无茶馆材料>')
寻路(45160,62084,1063552)
寻路(44010,62084,1063488)
寻路(43251,62084,1063424)
寻路Ex(43141,62114,1063488,1)
交易行_买物('胡雪严','大黄',4,30,0)
延时(3000)
交易行_买物('胡雪严','杂碎',4,30,0)
延时(3000)
寻路Ex(43331,62109,1063424,1)
收信_取指定物品('鲁啸声','大黄|血|碎肉|杂碎|铅锌矿')
背包_统计列表物品数量('杂碎|大黄','<',1,'<无茶馆材料>')
寻路(43881,62102,1063488)
寻路(45032,62102,1063488)
寻路(45054,63214,1063488)
跳转至标签('<跨图购买物品-杂碎准备杂碎流民衣服完毕>')

<跨图购买物品-衣食无忧·肉粥>
背包_统计列表物品数量('精肉|碎肉','>',0,'<跨图购买物品-衣食无忧·肉粥完毕>')
账号锁定跳转('是','<无茶馆材料>')
寻路(45160,62084,1063552)
寻路(44010,62084,1063488)
寻路(43251,62084,1063424)
寻路Ex(43141,62114,1063488,1)
交易行_买物('胡雪严','精肉',4,30,0)
延时(3000)
交易行_买物('胡雪严','碎肉',4,30,0)
延时(3000)
寻路Ex(43331,62109,1063424,1)
收信_取指定物品('鲁啸声','精肉|大黄|血|碎肉|杂碎|铅锌矿')
背包_统计列表物品数量('杂碎|大黄','<',1,'<无茶馆材料>')
寻路(43881,62102,1063488)
寻路(45032,62102,1063488)
寻路(45054,63214,1063488)
跳转至标签('<跨图购买物品-衣食无忧·肉粥完毕>')

<跨图购买物品-衣食无忧·汤药>
背包_统计列表物品数量('甘草|彼岸花','>',0,'<跨图购买物品-衣食无忧·汤药完毕>')
账号锁定跳转('是','<无茶馆材料>')
寻路(45160,62084,1063552)
寻路(44010,62084,1063488)
寻路(43251,62084,1063424)
寻路Ex(43141,62114,1063488,1)
交易行_买物('胡雪严','甘草',4,30,0)
延时(3000)
交易行_买物('胡雪严','彼岸花',4,30,0)
延时(3000)
寻路Ex(43331,62109,1063424,1)
收信_取指定物品('鲁啸声','甘草|彼岸花|精肉|大黄|血|碎肉|杂碎|铅锌矿')
背包_统计列表物品数量('甘草|彼岸花','<',1,'<无茶馆材料>')
寻路(43881,62102,1063488)
寻路(45032,62102,1063488)
寻路(45054,63214,1063488)
跳转至标签('<跨图购买物品-衣食无忧·汤药完毕>')


<跨图购买物品-铅锌矿>
背包_统计列表物品数量('甘草|铅锌矿','>',0,'<跨图购买物品-铅锌矿准备完毕>')
账号锁定跳转('是','<无茶馆材料>')
寻路(45160,62084,1063552)
寻路(44010,62084,1063488)
寻路(43251,62084,1063424)
寻路Ex(43141,62114,1063488,1)
交易行_买物('胡雪严','甘草',4,30,0)
延时(3000)
交易行_买物('胡雪严','铅锌矿',4,30,0)
延时(3000)
寻路Ex(43331,62109,1063424,1)
收信_取指定物品('鲁啸声','甘草|铅锌矿')
背包_统计列表物品数量('甘草|铅锌矿','<',1,'<无茶馆材料>')
寻路(43881,62102,1063488)
寻路(45032,62102,1063488)
寻路(45054,63214,1063488)
跳转至标签('<跨图购买物品-铅锌矿准备完毕>')

<做完茶馆了>
延时(3000)