交通_寻路神行车夫('成都',73846,65860,1070400,'卡点下线')
上马()
轻功寻路(74144,66650,1070400)
轻功寻路(73784,67315,1070400)
轻功寻路(74094,68997,1070784)
下马()
<重复>
<去捡野果EX>
<去捡野果>
寻路Ex(74182,71295,1070912,1)
交互Ex()
背包_统计列表物品数量('黏糊糊的糖块','>',20,'<流氓兔>')
背包_统计列表物品数量('野果','<',10,'<去捡野果>')
背包_统计列表物品数量('野果','=',10,'<制作山楂>')
<去买万能小糖包EX>
背包_统计列表物品数量('万能小糖包','>',10,'<制作山楂>')
<去买万能糖包>
NPC_寻路('姬司兔')
NPC_买物('姬司兔','杂货','万能小糖包',10)
<制作山楂>
背包_统计列表物品数量('黏糊糊的糖块','>',20,'<流氓兔>')
寻路Ex(75223,71263,1070912,1)
NPC_寻路('球球兔')
NPC_对话选项(2)
NPC_对话选项内容('C 4441 204')
NPC_对话('球球兔')
NPC_对话选项内容('C 领取糖果。')
延时(1000)
背包_统计列表物品数量('野果','>',1,'<制作山楂>')
背包_统计列表物品数量('野果','=',0,'<去捡野果>')
背包_统计列表物品数量('万能小糖包','=',0,'<去买万能糖包>')
跳转至标签('<重复>')
<流氓兔>
背包_统计列表物品数量('野果','<',10,'<去捡野果>')
<重复EX>
寻路Ex(74595,70978,1070784,1)
NPC_对话('榴芒兔')
NPC_对话选项(0)
NPC_对话选项内容('C 2231 207')
背包_物品列表存在('黏糊糊的糖块','是',<流氓兔>)
条件跳转('背包物品不存在', '黏糊糊的糖块', '默认', '<去捡野果>')
跳转至标签('<重复EX>')